This Dataset can be found on kaggle: https://www.kaggle.com/datasets/kaggle/sf-salaries

# Salaries at San Francisco EDA

## Importing Pandas:

In [1]:
import pandas as pd

## Reading Salaries.csv as a DataFrame

In [2]:
df = pd.read_csv(r"C:\Users\boudy\Downloads\SF salaries\Salaries.csv")
df.sample(5)

C:\Users\boudy\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3444: DtypeWarning: Columns (3,4,5,6,12) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
143713,143714,Suzan J Foley,Public Service Trainee,11095.00,0.00,0.00,110.98,11095.00,11205.98,2014,NaN,San Francisco,PT
40213,40214,Roger Lu,Police Officer 3,117162.74,19328.71,6939.06,35185.44,143430.51,178615.95,2012,NaN,San Francisco,NaN
56561,56562,Rafael Ibarra,X-Ray Laboratory Aide,59049.08,1246.66,3853.59,29394.67,64149.33,93544.00,2012,NaN,San Francisco,NaN
133790,133791,Anthony Jackson,Porter,54703.01,4714.33,712.98,25917.40,60130.32,86047.72,2014,NaN,San Francisco,FT
25435,25436,ROY NORWOOD,TRANSIT OPERATOR,40366.82,5695.01,1486.48,NaN,47548.31,47548.31,2011,NaN,San Francisco,NaN

In [3]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [4]:
df.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

Here we notice that there are some columns with type "Object" But they are meant to be 'float64'

Like: BasePay, PvertimePay, OtherPay, Benefits

That might cause some problems...

In [6]:
df.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

In [7]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Id,148654.0,74327.500000,42912.857795,1.00,37164.250,74327.50,111490.750,148654.00
TotalPay,148654.0,74768.321972,50517.005274,-618.13,36168.995,71426.61,105839.135,567595.43
TotalPayBenefits,148654.0,93692.554811,62793.533483,-618.13,44065.650,92404.09,132876.450,567595.43
Year,148654.0,2012.522643,1.117538,2011.00,2012.000,2013.00,2014.000,2014.00
Notes,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
numerical_cols = [col for col in df.columns if df[col].dtype in ['int64', 'float64']]

## What is the average basePay?

In [9]:
df['BasePay'].dtype

dtype('O')

That means that the data type of this column is 'Object', and that doesn't make sense

In [10]:
df['BasePay'].values

array([167411.18, 155966.02, 212739.13, ..., 'Not Provided',
       'Not Provided', '0.00'], dtype=object)

### To Replace The 'Not Provided' Values with NaN values we must import numpy

In [11]:
import numpy as np

In [12]:
df['BasePay'] = df['BasePay'].replace('Not Provided', np.nan)

In [13]:
df['BasePay'] = pd.to_numeric(df['BasePay'])

In [14]:
df['BasePay'].mean()

66325.44884050643

## What is the highest amount of overtime pay?

In [15]:
df['OvertimePay'].dtype

dtype('O')

Here we can see that we have the same problem as before

In [16]:
df['OvertimePay'].values

array([0.0, 245131.88, 106088.18, ..., 'Not Provided', 'Not Provided',
       '0.00'], dtype=object)

In [17]:
df['OvertimePay'] = df['OvertimePay'].replace('Not Provided', np.nan)

In [18]:
df['OvertimePay'] = pd.to_numeric(df['OvertimePay'])

In [19]:
df['OvertimePay'].max()

245131.88

## What is the job title of JOSEPH DRISCOLL?

In [20]:
df[df['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

## How much does Joseph earns?

In [21]:
df[df['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

## What is the name of the highest paid ?

In [22]:
df[df['TotalPayBenefits'] == df['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

## What is the name of the lowest paid person?

In [23]:
df[df['TotalPayBenefits'] == df['TotalPayBenefits'].min()]['EmployeeName']

148653    Joe Lopez
Name: EmployeeName, dtype: object

## All the Records with negative Total Pay Benifits

In [24]:
df[df['TotalPayBenefits'] < 0]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
110528,110529,Timothy E Gibson,Police Officer 3,NaN,0.0,0.0,-2.73,0.00,-2.73,2013,NaN,San Francisco,NaN
110529,110530,Mark E Laherty,Police Officer 3,NaN,0.0,0.0,-8.2,0.00,-8.20,2013,NaN,San Francisco,NaN
110530,110531,David P Kucia,Police Officer 3,NaN,0.0,0.0,-33.89,0.00,-33.89,2013,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

## What is the average (mean) BasePay of all employees per year? (2011/2014)

In [25]:
df.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

## How many unique job titles are there?

In [26]:
df['JobTitle'].nunique()

2159

## What are the top 5 most common jobs?

In [27]:
df['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

## How many job titles were represented by only one person in 2013?

In [28]:
(df[df['Year'] == 2013]['JobTitle'].value_counts() == 1).sum()

202

## How many people have the word chief in their job title?

In [29]:
j = 0
for i in df['JobTitle']:
    if 'chief' in i.lower():
        j = j + 1
        
print(j)

627

## Is there any relationship between length of the job title string and Salary?

In [30]:
df['LengthOfJobTitleString'] = df['JobTitle'].apply(len)
df.head(5)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,LengthOfJobTitleString
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN,46
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN,31
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN,31
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN,36
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN,44

In [31]:
df[['LengthOfJobTitleString', 'TotalPayBenefits']].corr()

                        LengthOfJobTitleString  TotalPayBenefits
LengthOfJobTitleString                1.000000         -0.036878
TotalPayBenefits                     -0.036878          1.000000

## So There is no correlation between the 2 features

# Thanks